from flask import Flask, render_template, request, redirect, url_for, flash, jsonify
from flask_sqlalchemy import SQLAlchemy
from flask_login import LoginManager, UserMixin, login_user, login_required, logout_user, current_user
from flask_bcrypt import Bcrypt  #розширення для хешування паролів користувачів.
from datetime import datetime
from sqlalchemy.exc import IntegrityError #для обробки помилок цілісності бази даних.

from sqlalchemy import ForeignKey
from sqlalchemy.orm import relationship



app = Flask(__name__)
app.config['SECRET_KEY'] = 'AF7DAEC41119A548D225221CDAAD3'
app.config['SQLALCHEMY_DATABASE_URI'] = 'sqlite:///portal.db'
db = SQLAlchemy(app)
bcrypt = Bcrypt(app)
login_manager = LoginManager(app)


#Створення об'єктів моделей

class Article(db.Model):
    __tablename__ = 'articles'
    id = db.Column(db.Integer, primary_key=True)
    title = db.Column(db.String(300), nullable=False)
    author = db.Column(db.String(100), nullable=False)
    date_published = db.Column(db.DateTime, nullable=False)
    tags = db.Column(db.String(100), nullable=False)
    content = db.Column(db.Text, nullable=False)
    photo = db.Column(db.String(255))

class Users(db.Model, UserMixin):
    __tablename__ = 'users'
    id = db.Column(db.Integer, primary_key=True)
    username = db.Column(db.String(100), unique=True, nullable=False)
    email = db.Column(db.String(120), unique=True, nullable=False)
    password = db.Column(db.String(60), nullable=False)
    saved_articles = db.relationship('SavedArticle', backref='user', lazy=True)
    comments = db.relationship('Comment', backref='author', lazy=True)

class SavedArticle(db.Model):
    id = db.Column(db.Integer, primary_key=True)
    user_id = db.Column(db.Integer, db.ForeignKey('users.id'), nullable=False)
    article_id = db.Column(db.Integer, db.ForeignKey('articles.id'), nullable=False)

    article = db.relationship('Article', foreign_keys=[article_id])


class Comment(db.Model):
    id = db.Column(db.Integer, primary_key=True)
    user_id = db.Column(db.Integer, db.ForeignKey('users.id'), nullable=False)
    article_id = db.Column(db.Integer, nullable=False)
    text = db.Column(db.Text, nullable=False)

#Створення таблиць баз даних
with app.app_context():
    db.create_all()

#Завантаження користувачів
@login_manager.user_loader
def load_user(user_id):
    return Users.query.get(int(user_id))

# Головна сторінка
@app.route('/', methods=['GET', 'POST'])
def index():
    if request.method == 'POST':
        keyword = request.form['keyword']

        query = Article.query

        #Пошук статей за словом
        if keyword:
            query = query.filter(Article.title.contains(keyword) | Article.content.contains(keyword))

        query = query.order_by(Article.date_published.desc())

        articles = query.all()

        if current_user.is_authenticated:
            articles = articles
        else:
            articles = query.limit(3).all()
    else:
        if current_user.is_authenticated:
            articles = Article.query.order_by(Article.date_published.desc()).all()
        else:
            articles = Article.query.order_by(Article.date_published.desc()).limit(3).all()
    return render_template('index.html', articles=articles)


#Провірка чи користувач уже зберігав цей пост раніше
@app.route('/check_article_saved/<int:article_id>')
@login_required
def check_article_saved(article_id):
    existing_saved_article = SavedArticle.query.filter_by(user_id=current_user.id, article_id=article_id).first()
    if existing_saved_article:
        return jsonify({'saved': True})
    else:
        return jsonify({'saved': False})


#Регістрація
@app.route('/register', methods=['GET', 'POST'])
def register():
    if request.method == 'POST':
        username = request.form['username']
        email = request.form['email']
        password = request.form['password']

        hashed_password = bcrypt.generate_password_hash(password).decode('utf-8')

        user = Users(username=username, email=email, password=hashed_password)
        try:
            db.session.add(user)
            db.session.commit()
            flash('Ваш обліковий запис був створений. Ви можете увійти!', 'success')
            return redirect(url_for('login'))
        except IntegrityError as e:
            db.session.rollback() #поверне базу даних до стану, яким вона була до початку цієї транзакції.
            flash('Ця електронна пошта вже використовується. Будь ласка, виберіть іншу.', 'error')

    return render_template('register.html')

#Вхід
@app.route('/login', methods=['GET', 'POST'])
def login():
    if request.method == 'POST':
        username = request.form['username']
        password = request.form['password']
        user = Users.query.filter_by(username=username).first()
        if user and bcrypt.check_password_hash(user.password, password):
            login_user(user)
            return redirect(url_for('index'))
        else:
            flash('Невірний логін або пароль.', 'error')
    return render_template('login.html')

#Вихід
@app.route('/logout')
@login_required
def logout():
    logout_user()
    return redirect(url_for('index'))

#Збереження статті в базу даних певним користувачем
@app.route('/save_article_ajax/<int:article_id>', methods=['POST'])
@login_required
def save_article_ajax(article_id):
    # Перевірка чи користувач вже зберіг цю статтю
    existing_saved_article = SavedArticle.query.filter_by(user_id=current_user.id, article_id=article_id).first()
    if existing_saved_article:
        return jsonify({'message': 'Ця стаття вже збережена.'})
    else:
        #Якщо стаття не збережена, додаємо запис до таблиці SavedArticle
        saved_article = SavedArticle(user_id=current_user.id, article_id=article_id)
        db.session.add(saved_article)
        db.session.commit()
        return jsonify({'message': 'Матеріал збережено для подальшого читання.'})

#Сторінка з збереженими статтями певного користувача
@app.route('/saved_articles')
@login_required
def saved_articles():
    saved_articles = SavedArticle.query.filter_by(user_id=current_user.id).all()
    return render_template('saved_articles.html', saved_articles=saved_articles)

#Сторінка певної статті
@app.route('/article/<int:article_id>')
def article(article_id):
    article = Article.query.get_or_404(article_id)

    comments = Comment.query.filter_by(article_id=article_id).all()

    return render_template('article.html', article=article, comments=comments)


#Залишання коментарів під матеріалами
@app.route('/comment/<int:article_id>', methods=['POST'])
@login_required
def comment(article_id):
    text = request.form['comment_text']
    comment = Comment(user_id=current_user.id, article_id=article_id, text=text)
    db.session.add(comment)
    db.session.commit()
    
    return redirect(url_for('article', article_id=article_id))


# app_ctx = app.app_context()
# app_ctx.push()
# db.create_all()
# article1 = Article(title='Калуський суддя знайшов у своєму кабінеті пристрій для прослуховування', author='Вікна Калуш', date_published=datetime(2023, 10, 4), tags='Суд Прослуховування', content='За вказаними фактами суддя Олег Мигович звернувся до Калуського районного відділу поліції Головного управління Національної поліції в Івано-Франківській області та повідомив про вчинення кримінального правопорушення, передбаченого статтею 359 Кримінального кодексу України — незаконні придбання, збут або використання спеціальних технічних засобів отримання інформації, повідомляють "Вікна" з посиланням на Вищу раду правосуддя. Матеріали за його заявою зареєстровані та направлені до Управління Служби безпеки України в Івано-Франківській області для прийняття рішення. Наразі перевірку повідомлених обставин здійснюють правоохоронні органи. На переконання судді, незаконне збирання інформації шляхом встановлення в його службовому кабінеті спеціальних технічних засобів негласного отримання інформації є втручанням у здійснення правосуддя та проявом неповаги до суду. Випадки, що мають ознаки кримінальних правопорушень, повинні бути належним чином досліджені правоохоронними органами, а винні особи — притягнуті до передбаченої законом відповідальності. З огляду на вказане, ВРП вирішила звернутися до Офісу Генерального прокурора щодо надання інформації про розкриття та розслідування злочину у кримінальному провадженні за фактами, повідомленими суддею Калуського міськрайонного суду Івано-Франківської області Олегом Миговичем.', photo='/static/images/syd.webp')
# article2 = Article(title='В Калуській громаді планують встановити нові дорожні знаки', author='Вікна Калуш', date_published=datetime(2023, 10, 4), tags='Дорожні знаки', content='29 вересня в електронній системі державних закупівель Прозорро калуське комунальне підприємство "Міськсвітло" оголосило закупівлю дорожніх знаків з бюджетом понад 550 тис. гривень. Період подання пропозицій на участь у тендері завершується 7 жовтня, аукціон запланований на 9 жовтня, повідомляють "Вікна". Комунальне підприємство має намір купити 128 різних дорожніх знаків, а також 304 кріплення для знаків, бандажну стрічку та скоби до неї. У вимогах до предмету закупівлі зазначено, що дорожні знаки, які встановлюються на дорогах місцевого значення, мають відповідати вимогам держстандарту, з терміном експлуатації — 7 років. Вони мають бути виготовлені з оцинкованого металу, основа — зі сталі товщиною 0,7-1 мм, з лицевого боку дорожні знаки мають мати світловідбиваючу плівку, а тильна сторона повинна бути пофарбована полімерним покриттям сірого кольору, що не відбиває світло фар зустрічного транспорту. Усі товари повинні бути новими, належним чином упаковані та доставлені до 20 листопада поточного року. Це не перша закупівля дорожніх знаків КП "Міськсвітло" у 2023 році. Так, у травні комунальне підприємство купило 176 різних дорожніх знаків, договір було укладено на близько 382,6 тис. гривень. Таким чином загальний обсяг закупівлі дорожніх знаків у поточному році — 304 штуки. Для порівняння, як випливає зі звіту про роботу КП "Міськсвітло" у 2022 році було встановлено 48 дорожніх знаків та проведено поточний ремонт 17-ти. Як повідомив у коментарі "Вікнам" директор комунального підприємства Іван Кохан, такої кількості нових дорожніх знаків, яку планують купити і встановити у цьому році, у попередні роки не було. За його словами, рішення щодо місць встановлення нових знаків приймає координаційна рада з питань безпеки дорожнього року. Окрім того, зараз купують великі дорожні знаки — анонси, які будуть встановлені на в’їздах на територію Калуської громади, вони є дорожчими, що впливає на бюджет закупівлі. Загалом на території громади вже встановлено більше тисячі дорожніх знаків.', photo='/static/images/dorz.png')
# article3 = Article(title='ФК "Гарда" розгромив брошнівські "Карпати"', author='Вікна Калуш', date_published=datetime(2023, 10, 3), tags='Футбол', content='На 6-ій хвилині матчу калушани відкрили рахунок, голом відзначився нападник Денега. Через 10 хвилин, на 16-ій хвилині матчу Яневич подвоїв перевагу "Гарди", розповів у соцмережі Ярослав Куцій, інформують "Вікна". Проте калушанам було цього недостатньо. На 39-ій хвилині матчу "Гарда" знову відзначилася у воротах номінальних господарів. Цього разу мʼяч забив нападник Дяків. Наприкінці першого тайму Цюпер реалізував пенальті, що дозволило "Карпатам" відквитати один мʼяч. За рахунком 1:3 на користь гостей команди пішли на перерву. Другий тайм розпочався активними діями калушан і на 57-ій хвилині Дяків оформив дубль у ворота номінальних господарів. Наприкінці матчу, на 88-ій хвилині Мельник відправив мʼяч у сітку "Карпат", встановивши остаточний рахунок у матчі — 1:5.', photo='/static/images/foot.jpg')
# article4 = Article(title='У Калуші оприлюднили нові тарифи на опалення', author='Вікна Калуш', date_published=datetime(2023, 9, 26), tags='Тарифи Опалення', content='25 вересня на сайті Калуської міської ради комунальне підприємство «Калуська енергетична Компанія» оприлюднило повідомлення для споживачів — інформацію про намір змінити тарифи на теплову енергію, її виробництво, транспортування та постачання, послуги з постачання теплової енергії на опалювальний сезон 2023/2024 років. Нагадаємо, комунальне підприємство забезпечує тепловою енергією власних споживачів — це мешканці шести багатоквартирних житлових будинків та бюджеті установи, які опалюються від котелень «Калуської енергетичної компанії» (загальний тариф включає тарифи на виробництво, транспортування та постачання теплової енергії). А окрім того надає послугу з транспортування теплової енергії від Калуської ТЕЦ ТОВ «Костанза», який є складовою тарифу на опалення для споживачів теплоелектроцентралі, інформують "Вікна". Нові тарифи не вплинуть на населення. У повідомленні зазначено, що Законом України №2479 — 1Х від 29.07.2022року в редакції від 27.07.2023 року №3220–1Х «Про особливості регулювання відносин на ринку природного газу та у сфері теплопостачання під час дії воєнного стану та подальшого відновлення їх функціонування» протягом дії воєнного стану в Україні та шести місяців після місяця, в якому воєнний стан буде припинено або скасовано, забороняється підвищення тарифів на: послуги з розподілу природного газу для всіх категорій споживачів; теплову енергію (її виробництво, транспортування та постачання) для населення, послуги з постачання теплової енергії для населення. Чинні тарифи на теплову енергію, її виробництво, транспортування та постачання, послугу з постачання теплової енергії КП «Калуська енергетична Компанія» були встановлені рішенням виконавчого комітету Калуської міської ради від 25.10.2022 року №242. ', photo='/static/images/taryf.jpg')
# article5 = Article(title='Рятувальники розшукали 75-річну калушанку, яка заблукала на "Заліссі"', author='Вікна Калуш', date_published=datetime(2023, 9, 25), tags='Розшук Залісся', content='25 вересня о 15:40 до Служби порятунку надійшло повідомлення від жительки міста Калуш про те, що вона під час збирання грибів в лісовому масиві поблизу урочище "Залісся" втратила орієнтування та заблукала, тому потребує допомоги рятувальників. Для надання допомоги було направлено рятувальників пошуково-рятувального відділення міста Івано-Франківськ, які знайшли заблукалу громадянку, 1947 року народження. Рятувальники супроводили жінку до працівників Національної поліції у задовільному стані, інформують "Вікна" з посиланням на Головне управління ДСНС України в Івано-Франківській області. Рятувальники вкотре нагадують громадянам про те, що необхідно відповідально ставитися до походів в ліс. Перед тим, як вирушити до лісу, потрібно вивчити карту місцевості, або краще вирушити з тим, хто добре знає місцевість. Також важливо подбати про повний заряд мобільного телефону.', photo='/static/images/zal.jpg')
# article6 = Article(title='«Укрпошта» ввела в обіг марку із зображенням гурту Kalush Orchestra', author='Zaxid', date_published=datetime(2023, 6, 10), tags='Укр пошта Калуш', content='У Калуші погасили нову поштову марку від «Укрпошти» із зображенням Олега Псюка, лідера гурту Kalush Orchestra. Номінал марки 15 гривень, тираж складає 780 тисяч одиниць. До марки також випустили конверт «Перший день», немаркований художній конверт та художню листівку. Марку можна купити у відділеннях «Укрпошти» у всіх регіонах країни. Про урочисте погашення нової марки від «Укрпошти» у понеділок, 10 квітня, повідомив міський голова Калуша Андрій Найда. За його словами, підписання перших марок здійснив керівник «Укрпошти» Ігор Смілянський, та учасники гурту – Олег Псюк і Килим-мен. Дизайн марки належить Святославу Романчаку, художниця конвертів – Олеся Вакуленко, дизайн листівки – Юрій Сосницький. Марку можна купити у відділеннях «Укрпошти» по всій країні.', photo='/static/images/ukr.jpg')
# article7 = Article(title='«Домашнє насильство НЕ приватна справа»', author='Калуська Міська Рада', date_published=datetime(2023, 10, 2), tags='Насильство', content='«Щороку через домашнє насильство в Україні помирає 600 жінок... Ми навіть не маємо повного розуміння і офіційної статистики. Адже не відомо, скільки жінок помирає від внутрішніх хвороб чи травм, що не були ідентифіковані як наслідки регулярного домашнього насильства". Таку проблематику підняла на тренінгу "Домашнє насильство НЕ приватна справа" кар\'єрна радниця проєкту "ВОНА хаб", кандидатка економічних наук Ірина Серняк. В ході тренінгового заняття працівники структурних підрозділів Калуської міської ради обговорити актуальну та гостру тему сьогодення. Експертка, зокрема, розповіла, за якими ознаками серед працівників та працівниць того чи іншого колективу розпізнати постраждалих від домашнього насильства; як домашнє насильство впливає на робочий процес та економічні показники діяльності підприємства; пояснила, чому не можна звільняти працівниць (-ків), постраждалих від домашнього та гендерно зумовленого насильства.  Захід організований управлінням економічного розвитку міста Калуської міської ради та міським центром соціальних служб за фінансової підтримки уряду Канади Embassy of Canada to Ukraine. Нагадуємо, що у нашій громаді, за підтримки UNFPA, Уряду CANADA та БФ "Батерфлай" працює мобільна бригада соціально-психологічної допомоги постраждалим від домашнього насильства. Контактний номер телефону: 067 600 31 46 або за адресою: м. Калуш, вул. Героїв України, 9а.', photo='/static/images/kmr.jpg')
# article8 = Article(title='У Калуші відбулися урочистості з нагоди Дня працівників освіти.', author='Калуська Міська Рада', date_published=datetime(2023, 9, 29), tags='Громада Освіта', content='Вони не просто навчають, але і доводять – освіта жива, орієнтована на здобувача, крокує у ногу із часом. У Калуській громаді функціонує 21 заклад середньої освіти, де навчається 8856 здобувачів освіти. Також працюють 14 закладів дошкільної освіти, де виховують майже 2 тисячі діток. Є три заклади позашкілля, Калуська дитяча музична школа, а також 4 заклади професійної освіти. Сьогодні представники цих закладів, працівники освітньої галузі громади запрошені до Концертної зали на урочистості з нагоди Дня працівників освіти. Цього року педагоги приймали вітання від міського голови Андрія Найди, заступниці міського голови Надії Гуш та начальниці відділу освіти Ірини Люклян. Були і традиційні нагороди й відзнаки.Відзнаки отримали цьогорічні лауреати премії ім. К. Малицької – престижної освітянської нагороди у громаді. Ними стали: вихователька ЗДО «Росинка» Оксана Воробець, учитель предмету «Захист України» Калуського ліцею №10 Богдан Когут і директорка ліцею ім. Д. Бахматюка Оксана Табачук. Срібний значок «Калуш», почесну грамоту міського голови і грошову премію отримали вчителька основ християнської етики ліцею №7 Інна Бусел та заступниця директора ліцею №2 Тамара Тисяк. 36 працівників освіти отримали Почесні грамоти міського голови. Грамотами нагороджено 67 освітян, керівництва районної державної адміністрації – 13.  Ще 8 працівників освітньої галузі громади отримали грамоти Департаменту освіти і науки Івано-Франківської ОДА. Подякою Міністерства освіти і науки України нагороджена вчителька української мови і літератури ліцею ім. Дмтра Бахматюка Ольга Сербін. Дякуємо за вашу благородну справу! Усіх благ вам, дорогі освітяни!', photo='/static/images/gromada.jpg')
# article9 = Article(title='КАЛУШАНКИ ВИГРАЛИ НАВЧАННЯ ДЛЯ РЕАЛІЗАЦІЇ БІЗНЕС-ІДЕЙ', author='Калуська Міська Рада', date_published=datetime(2023, 9, 26), tags='Громада', content='Авторки трьох кращих бізнес-ідей отримали приємний бонус для подальшого розвитку: 10 годин консультацій із ведення бухгалтерського обліку.  Хто із якими ідеями переміг? Наталія Охтирок: ця талановита майстриня створює оригінальні ексклюзивні сумки ручної роботи. Її бізнес не лише відзначається креативністю, але й підтримує ручну роботу та індивідуальний підхід до кожного виробу. Мар\'яна Шептинська: майбутня підприємиця планує відкрити свою власну крафтову кав\'ярню під назвою «Dolce». Її відданість і пристрасть до кави обіцяють створити місце, де люди зможуть насолоджуватися смачними десертами, ароматною кавою та приємною атмосферою. Інна Сорока: переможниця планує відкрити станцію самообслуговування автомобілів «Зробіть самі!». Її ідея спрямована на забезпечення зручності та доступності автомобільного обслуговування для місцевих жителів та водіїв. Проєкт реалізується ГО «УФРА» в межах програми міжнародної співпраці EU4Business: відновлення, конкурентоспроможність та інтернаціоналізація МСП, яку спільно фінансують Європейський Союз і уряд Німеччини. Цей грантовий конкурс виконує Фонд розвитку підприємництва, а стратегічним виконавцем програми є німецька федеральна компанія Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH. Успіхів калушанкам на шляху до реалізації мрій! У відео – більше про Demo Day «Вона може!».', photo='/static/images/gro.jpg')
# article0 = Article(title='Калуські «Золоті сурми» та «Сузір’я» виступили в Франції', author='Калуська Міська Рада', date_published=datetime(2023, 9, 26), tags='Культура', content='Це вже не вперше, коли «Золоті сурми» і «Сузір’я» прославляють Україну та наше місто на міжнародному рівні!  Цього разу Гімн України звучав поруч з духовими оркестрами Голландії, Індії, Бельгії, Італії, Франції!  Відрадно, що у цей надскладний для нашої держави час, мистецький тил не зупиняється, продовжує розвиватися, дивувати та захоплювати своїх глядачів, доводячи всьому світові, що українці – незламна нація! Під час виступів наших колективів глядачі піднімалися зі своїх місць, вигукуючи «Україна» та запрошували виступати «на біс».  Протягом чотирьох днів світ милувався калуськими талантами! Втомлені, але щасливі учасники колективів разом зі своїми наставниками повертаються додому. Щиро радіємо успіхам і дякуємо, що своєю наполегливо працею й талантом примножуєте мистецькі здобутки міста!', photo='/static/images/cult.jpg')
# db.session.add(article1)
# db.session.add(article2)
# db.session.add(article3)
# db.session.add(article4)
# db.session.add(article5)
# db.session.add(article6)
# db.session.add(article7)
# db.session.add(article8)
# db.session.add(article9)
# db.session.add(article0)
# db.session.commit()
# app_ctx.pop()

if __name__ == "__main__":
    app.run(debug=False)